Revit 2026 API

# InstanceVoidCutUtils Methods

---

The InstanceVoidCutUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddInstanceVoidCut | Add a cut to an element using the unattached voids inside a cutting instance. |
|  | CanBeCutWithVoid | Indicates if the element can be cut by an instance with unattached voids. |
|  | GetCuttingVoidInstances | Return ids of the instances with unattached voids cutting the element. |
|  | GetElementsBeingCut | Return ids of the elements being cut by the instance |
|  | InstanceVoidCutExists | Check whether the instance is cutting the element |
|  | IsVoidInstanceCuttingElement | Indicates if the element is a family instance with unattached voids that can cut other elements. |
|  | RemoveInstanceVoidCut | Remove a cut applied to the element by a cutting instance with unattached voids. |

#### Reference

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace